<template>
  <v-row justify="center">
    <v-dialog
      :value="value"
      @input="$emit('input',$event)"
      scrollable
      max-width="450px"
    >
      <v-card>
        <v-card-title>
          <v-icon>mdi-information-outline</v-icon>
          <v-spacer></v-spacer>
          بيان اخلاء المسؤولية
          <v-spacer></v-spacer>
          <v-btn icon @click="$emit('input',false)">
            <v-icon>mdi-close</v-icon>
          </v-btn>
          
        
        </v-card-title>
        <v-divider></v-divider>
        <v-card-text style="height: 600px;" class="py-4">
          <p class="headline-custom"> بيان إخلاء المسؤولية </p>
          <p><strong>عميلنا العزيز</strong></p>
          <p>إن شروط بيان إخلاء المسئولية هذا (المشار إليه فيما بعد بـ "البيان") تنطبق على هذا الموقع  لذلك يرجى قراءة هذا البيان بعناية.</p>
          <p>الدخول إلى هذا الموقع أو استخدام المعلومات المقدمة على/عن طريقه تعني موافقتك على الالتزام بهذا البيان. في حال وجود أي تعارض بين الأحكام والشروط المحددة لأي من المنتجات والخدمات وهذا البيان فإن الشروط الخاصة بهذه المنتجات والخدمات هي الي ستؤخذ بالإعتبار.</p>
          <p><strong>استخدام هذا الموقع</strong></p>
          <p>لا ينبغي استخدام المعلومات المقدمة على/عن طريق هذا الموقع كبديل لأي شكل من أشكال المشورة. وسوف تكون نتائج القرارات المبنية على هذه المعلومات على مسؤوليتك. وعلى الرغم من أن البنك يحاول توفير معلومات دقيقة وكاملة ومحدثة و التي تم الحصول عليها من مصادر يعتقد أنها موثوقه، إلا ان البنك لا يضمن أو يتعهد ما إذا كانت المعلومات المقدمة عن طريق هذا الموقع دقيقة ومحدثة.</p>
         
          <p>ويقوم البنك بإدارة على هذا الموقع و التحكم فيه من الرياض، المملكة العربية السعودية، ولا يتعهد بأن المعلومات المقدمة على أو من خلال هذا الموقع مناسبة أو متوفرة أو صالحة للاستخدام في مواقع أخرى.و إذا كنت تستخدم هذا الموقع من امكنه أخرى، فإنك مسئول عن الالتزام بالقوانين المطبقة لتلك الدول. ولا يضمن البنك أو يتعهد بأن هذا الموقع يعمل دون خطأ أو انقطاع على شبكة الإنترنت.</p><p>لقد تم اختبار هذا الموقع على المتصفح MS- Explorer ولا يضمن البنك وان هذا الموقع سيعمل بكفائه مع متصفحين آخرين.</p><p>لا يسمح استخدام هذا الموقع بشكل يعوق استخدام مستخدمين آخرين، والذي يمكن أن يعرض للخطر أو يؤثر سلبا على سير العمل في هذا الموقع و / أو يؤثر على المعلومات المقدمة على أو من خلال هذا الموقع أو البرامج الأساسية.</p><p><strong>معلومات ومنتجات وخدمات الطرف الثالث</strong></p><p>المقدمة عبر الانترنت ليست مصدقة أو مضمونة من قبل البنك .ان استخدام مثل هذه الروابط سيكون على مسؤوليتك الخاصة، ولن يتحمل البنك مسئولية أو التزام عن أي محتوى أو استخدام أو توفر مثل هذه المواقع. البنك لم يتحقق من حقيقة ودقة ومصداقية، و موثوقية، واكتمال أي محتوى لهذه المواقع.</p><p><strong>الملكية الفكرية</strong></p><p>يحتفظ البنك بجميع الحقوق (بما في ذلك حقوق النشر والعلامات التجارية وبراءات الاختراع ، فضلا عن أي حق أخر للملكية الفكرية) وذلك في ما يتعلق بجميع المعلومات المقدمة على أو عبر هذا الموقع (بما في ذلك جميع النصوص و الملفات والرسومات و الصور والشعارات). وبذلك فأنه لا يحق لك نسخ أو تحميل أو نشر أو توزيع أو إعادة إنتاج أي من المعلومات الواردة في هذا الموقع بأي شكل من الأشكال دون موافقة خطية مسبقة من البنك أو الموافقة المناسبة من المالك. و يحق للعميل طباعة و/ أو تحميل المعلومات أو الملفات العامه الواردة في هذا الموقع للاستعمال الشخصي فقط.</p><p>لا يسمح توجيه أي من الروابط الخاصة إلى موقع البنك دون موافقة خطية مسبقة من البنك.</p><p><strong>الاتصال عبر الانترنت</strong></p><p>إن الرسائل التي تقوم بإرسالها إلى البنك عن طريق البريد الالكتروني قد لا تكون آمنة.و يوصي البنك بعدم إرسال أي معلومات سرية عن طريق البريد الالكتروني.و إذا اخترت إرسال أية رسائل للبنك عن طريق البريد الإلكتروني ، فذلك يعني لخطر اعتراض معلوماتك أو إساءة استخدامها أو تعديلها من قبل طرف ثالث.</p><p><strong>استبعاد المسؤولية</strong></p><p>لن يكون البنك أو أي من وكلائه أو المتعاقدين معه من الباطن، مسئولين عن أي أضرار مباشرة أو غير مباشرة أو خاصة أو عرضية أو تبعية أو عقابية أو نموذجية ، بما في ذلك الأرباح المفقودة (حتى لو كان البنك على علم بها) والناشئة بأي شكل من الأشكال على سبيل المثال لا الحصر ، (أ) أي عيوب ، اوفيروسات أو أعطال أخرى لأية معدات او برامج أخرى عند الاتصال أو استخدام هذا الموقع على شبكة الإنترنت ، (ب) المعلومات المقدمة على أو من خلال هذا الموقع ، (ج) اعتراض أو تعديل أو سوء استعمال المعلومات المرسلة إلى البنك أو المرسلة إليك ، (د) الأداء أو عدم توافر هذا الموقع على شبكة الإنترنت ، (هـ) إساءة استخدام هذا الموقع على شبكة الإنترنت ، و) فقدان البيانات ، (ز) تحميل أو استخدام أي من البرامج التي يتيحها هذا الموقع ، (ح) مطالبات من أطراف ثالثة بخصوص استخدام هذا الموقع.</p><p>تم وضع بند استبعاد المسؤولية لمصلحة مدراء وموظفي البنك . القانون المطبق</p><p>يخضع هذا الموقع وشروطه ويتم تفسيره وفقا لقوانين المملكة العربية السعودية. وسوف يتم تقديم جميع المنازعات الناشئة عن أو الخاصة بهذا البيان إلى المحاكم المختصة في المملكة العربية السعودية.</p><p>في حال وجود تباين أو اختلاف في التفسير بين الصيغ اللغوية المختلفة لهذا البيان، فإن الصيغة العربية ستكون المعتمدة.</p><p><strong>التعديلات</strong></p><p>يحتفظ البنك بحق تغيير المعلومات المقدمة على او من خلال هذا الموقع في أي وقت ودون سابق إنذار، بما في ذلك شروط هذا البيان . فمن الموصى به القيام بمراجعة المعلومات المقدمة على هذا الموقع بما في ذلك شروط هذا البيان بشكل دوري لملاحظة أي تغييرات جديدة.</p><p><strong>بيان الخصوصية</strong></p><p>يدار هذا الموقع من قبل البنك المملكة العربية السعودية.</p><p>عند زيارتك لهذا الموقع فان البنك قد يجمع بعض البيانات الشخصية عنك، إما بشكل مباشرة (حيث يطلب منك تقديم البيانات) أو غير مباشر. مع ذلك فان البنك لن يستخدم معلوماتك الشخصية إلا وفقا للأغراض المبينة في بيان الخصوصية هذا، كما انه ملتزم بحماية المعلومات الشخصية التي يتم جمعها. ويوضح هذا البيان هدف البنك من جمع هذه المعلومات من خلال استخدام سجل المتصفح وكيفية تأثيره على حقوقك في احترام بياناتك الشخصية.</p><p><strong>أغراض المعالجة</strong></p><p>يجمع البنك المعلومات عن العملاء وزوار موقعه على الشبكة لتسيير أعمالها، ولابلاغك بالمنتجات والخدمات المتاحة التي قد تهمك من اجل تطوير الإحصاءات على شبكة الإنترنت. وسوف تستخدم المعلومات التي تقدمها للاتصال بك عند الضرورة، على سبيل المثال لنعلمك عن تغييرات وظائف الموقع على شبكة الإنترنت، ولعرض الخدمات التي قد نجدها ذات فائدة لك (شريطة ان لا تكون قد اخترت تلقي مثل هذه الخدمات).</p><p>وتخضع الطرق التي يستعملها البنك في جمع واستخدام البيانات الشخصية وغيرها، من خلال هذا الموقع على شبكة الإنترنت، لأنظمة المملكة العربية السعودية.</p><p><strong>البيانات الحساسة</strong></p><p>لا يسعى البنك لجمع بيانات شخصية حساسة (مثل بيانات تكشف عن آلاراء السياسية, المعتقدات الدينية ، الصحة ، أو مسائل أخرى) من خلال هذا الموقع. إذا سعى كان البنك إلى جمع مثل هذه البيانات، فسيكون بعد موافقة مسبقة من قبلكم. يرجى ملاحظة أنه عند قيامك بتوفير معلومات حساسة غير مطلوبة منك للبنك فإن هذا يعني موافقتك لنا باستخدام تلك البيانات على النحو المبين أعلاه.</p><p><strong>سجل المتصفح</strong></p><p>قد يجمع البنك ويحلل المعلومات بشأن استخدام هذا الموقع على شبكة الإنترنت، بما في ذلك اسم المجال، وعدد الزيارات، والصفحات التي تم زيارتها، والمواقع التي يتم زيارتها سابقاً/لاحقاً, ومدة الزيارة.و قد يتم جمع هذه المعلومات باستخدام سجل المتصفح.ان سجل المتصفح هو عبارة عن ملف نصي صغير يوضع على القرص الثابت على جهازك من قبل موقعنا.و يمكنك اختيار إما استخدام أو عدم استخدام سجل المتصفح عن طريق تغير خصائص المتصفح الخاص بك. سيجعل سجل المتصفح استخدام هذا الموقع على شبكة الإنترنت أسرع وأسهل.</p><p><strong>مواقع الطرف الثالث</strong></p><p>يرجى ملاحظة أن بيان الخصوصية لا يمتد إلى مواقع الطرف الثالث المرتبطة بهذا الموقع.</p><p><strong>كيفية تفعيل حقوقك؛ كيفية الاتصال البنك&nbsp;</strong></p><p>إذا كنت لا ترغب في تلقي الرسائل التسويقية من البنك، يمكنك الاتصال بنا عبر:</p><p><strong>التعديلات</strong></p><p>يحتفظ البنك بحق تعديل جزئيات بيان الخصوصية في أي وقت. لذا, يرجى مراجعة و قراءة هذا البيان من وقت لآخر لملاحظة أي تغييرات.</p><p><br></p>
 
        
        </v-card-text>
        <v-divider></v-divider>
        <v-card-actions>
          <v-btn
            color="blue darken-1"
            dark
            width="100%"
            @click="$emit('input', false)"
          >
            أغلاق
          </v-btn>
          
        </v-card-actions>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
  export default {
    name: 'Privacy',
    props: {
      value: Boolean
    } 
  }
</script>
